{
  "id": "coopPlatformer",
  "titleByLocale": {
    "en": "Let's make a Co-op Multiplayer game",
    "fr": "Créons un jeu multijoueur coopératif",
    "ar": "لنصنع لعبة جماعية متعددة اللاعبين",
    "de": "Lass uns ein Koop-Multiplayer-Spiel machen",
    "es": "Hagamos un juego multijugador cooperativo",
    "it": "Facciamo un gioco multigiocatore cooperativo",
    "tr": "Bir Kooperatif Çok Oyunculu Oyun Yapalım",
    "ja": "協力型のマルチプレイヤーゲームを作ろう",
    "ko": "협동 멀티플레이어 게임을 만들자",
    "pl": "Zróbmy grę kooperacyjną dla wielu graczy",
    "pt": "Vamos fazer um jogo multijogador cooperativo",
    "th": "มาสร้างเกมมัลติเพลเยอร์แบบร่วมมือกัน",
    "ru": "Давайте сделаем кооперативную многопользовательскую игру",
    "sl": "Naredimo kooperativno večigralsko igro",
    "sq": "Le të bëjmë një lojë me shumë lojtarë bashkëpunues",
    "uk": "Давайте створимо кооперативну багатокористувацьку гру",
    "zh": "让我们做一个合作多人游戏"
  },
  "bulletPointsByLocale": [
    {
      "en": "How to add and configure the multiplayer behavior",
      "fr": "Comment ajouter et configurer le comportement multijoueur",
      "ar": "كيفية إضافة وتكوين سلوك اللاعبين المتعددين",
      "de": "Wie man das Multiplayer-Verhalten hinzufügt und konfiguriert",
      "es": "Cómo añadir y configurar el comportamiento multijugador",
      "it": "Come aggiungere e configurare il comportamento multigiocatore",
      "tr": "Çok oyunculu davranışı nasıl ekleyip yapılandırabilirsiniz",
      "ja": "マルチプレイヤーの動作を追加して設定する方法",
      "ko": "멀티플레이어 동작을 추가하고 구성하는 방법",
      "pl": "Jak dodać i skonfigurować zachowanie dla wielu graczy",
      "pt": "Como adicionar e configurar o comportamento multijogador",
      "th": "วิธีเพิ่มและกำหนดค่าพฤติกรรมผู้เล่นหลายคน",
      "ru": "Как добавить и настроить многопользовательское поведение",
      "sl": "Kako dodati in konfigurirati vedenje za več igralcev",
      "sq": "Si të shtoni dhe konfiguroni sjelljen me shumë lojtarë",
      "uk": "Як додати та налаштувати поведінку для кількох гравців",
      "zh": "如何添加和配置多人行为"
    },
    {
      "en": "How an online player can control their character with the multiplayer ownership system",
      "fr": "Comment un joueur en ligne peut contrôler son personnage avec le système de propriété multijoueur",
      "ar": "كيف يمكن للاعب عبر الإنترنت التحكم في شخصيته باستخدام نظام الملكية المتعددة اللاعبين",
      "de": "Wie ein Online-Spieler seinen Charakter mit dem Mehrspieler-Eigentumssystem steuern kann",
      "es": "Cómo un jugador en línea puede controlar su personaje con el sistema de propiedad multijugador",
      "it": "Come un giocatore online può controllare il suo personaggio con il sistema di proprietà multiplayer",
      "tr": "Çevrimiçi bir oyuncunun çok oyunculu sahiplik sistemiyle karakterini nasıl kontrol edebileceği",
      "ja": "オンラインプレイヤーがマルチプレイヤー所有権システムでキャラクターを操作する方法",
      "ko": "온라인 플레이어가 멀티플레이어 소유 시스템을 통해 캐릭터를 제어할 수 있는 방법",
      "pl": "Jak gracz online może kontrolować swoją postać za pomocą systemu własności wieloosobowej",
      "pt": "Como um jogador online pode controlar seu personagem com o sistema de propriedade multijogador",
      "th": "ผู้เล่นออนไลน์สามารถควบคุมตัวละครของเขาด้วยระบบการเป็นเจ้าของแบบหลายผู้เล่นได้อย่างไร",
      "ru": "Как онлайн-игрок может управлять своим персонажем с помощью системы многопользовательского владения",
      "sl": "Kako lahko spletni igralec nadzoruje svoj lik z večigralskim lastniškim sistemom",
      "sq": "Si mund ta kontrollojë një lojtar në internet karakterin e tij me sistemin e pronësisë për shumë lojtarë",
      "uk": "Як онлайн-гравець може керувати своїм персонажем за допомогою системи багатокористувацького володіння",
      "zh": "在线玩家如何通过多人所有权系统控制他的角色"
    }
  ],
  "editorSwitches": {
    "Start": {
      "editor": "Scene",
      "scene": "Lobby"
    },
    "SwitchToGameScene": {
      "editor": "Scene",
      "scene": "GameScene"
    },
    "SwitchToEvents1": {
      "editor": "EventsSheet",
      "scene": "GameScene"
    }
  },
  "availableLocales": [
    "en",
    "fr",
    "ar",
    "de",
    "es",
    "it",
    "tr",
    "ja",
    "ko",
    "pl",
    "pt",
    "th",
    "ru",
    "sl",
    "sq",
    "uk",
    "zh"
  ],
  "initialTemplateUrl": "https://resources.gdevelop-app.com/in-app-tutorials/templates/coopPlatformer/game.json",
  "initialProjectData": {
    "Player1": "Player1",
    "Player2": "Player2",
    "Lobby": "Lobby",
    "GameScene": "GameScene"
  },
  "flow": [
    {
      "id": "Start",
      "tooltip": {
        "standalone": true,
        "description": {
          "messageByLocale": {
            "en": "This game is a multiplayer game with a pre-made lobby scene ready to let players join the game.\n\nWe will see how to let each online player control their own characters.",
            "fr": "Ce jeu est un jeu multijoueur avec une scène de lobby pré-fabriquée prête à permettre aux joueurs de rejoindre le jeu.\n\nNous verrons comment permettre à chaque joueur en ligne de contrôler son propre personnage.",
            "ar": "هذه اللعبة هي لعبة متعددة اللاعبين مع مشهد لوبي مُجهز مسبقًا للسماح للاعبين بالانضمام إلى اللعبة.\n\nسنرى كيف يمكن لكل لاعب عبر الإنترنت التحكم في شخصياته الخاصة.",
            "de": "Dieses Spiel ist ein Mehrspieler-Spiel mit einer vorgefertigten Lobby-Szene, die es den Spielern ermöglicht, dem Spiel beizutreten.\n\nWir werden sehen, wie jeder Online-Spieler seine eigenen Charaktere steuern kann.",
            "es": "Este juego es un juego multijugador con una escena de lobby pre-hecha lista para permitir que los jugadores se unan al juego.\n\nVeremos cómo permitir que cada jugador en línea controle sus propios personajes.",
            "it": "Questo gioco è un gioco multiplayer con una scena di lobby predefinita pronta per consentire ai giocatori di unirsi al gioco.\n\nVedremo come consentire a ciascun giocatore online di controllare i propri personaggi.",
            "tr": "Bu oyun, oyuncuların oyuna katılmasına izin vermek için hazır yapılmış bir lobisi sahip çok oyunculu bir oyundur.\n\nHer çevrimiçi oyuncunun kendi karakterlerini nasıl kontrol edebileceğini göreceğiz.",
            "ja": "このゲームは、事前に作成されたロビーシーンを備えたマルチプレイヤーゲームで、プレイヤーがゲームに参加できるようにしています。\n\n各オンラインプレイヤーが自分のキャラクターを操作できる方法を見ていきます。",
            "ko": "이 게임은 플레이어가 게임에 참여할 수 있도록 사전 제작된 로비 장면을 포함한 멀티플레이어 게임입니다.\n\n각 온라인 플레이어가 자신의 캐릭터를 제어하는 방법을 살펴보겠습니다.",
            "pl": "Ta gra jest grą wieloosobową z gotową sceną lobby, która umożliwia graczom dołączenie do gry.\n\nZobaczymy, jak pozwolić każdemu graczowi online kontrolować swoje postacie.",
            "pt": "Este jogo é um jogo multijogador com uma cena de lobby pré-fabricada pronta para permitir que os jogadores entrem no jogo.\n\nVeremos como permitir que cada jogador online controle seus próprios personagens.",
            "th": "เกมนี้เป็นเกมที่มีผู้เล่นหลายคนพร้อมฉากล็อบบี้ที่เตรียมไว้ล่วงหน้าเพื่อให้ผู้เล่นเข้าร่วมเกมได้\n\nเราจะมาดูวิธีการให้ผู้เล่นแต่ละคนควบคุมตัวละครของตัวเอง",
            "ru": "Эта игра является многопользовательской игрой с предварительно созданной сценой лобби, которая позволяет игрокам присоединиться к игре.\n\nМы увидим, как дать каждому онлайн-игроку возможность управлять своими собственными персонажами.",
            "sl": "Ta igra je večigralska igra s pripravljenim prizoriščem v preddverju, ki omogoča igralcem, da se pridružijo igri.\n\nVideli bomo, kako lahko vsak spletni igralec nadzoruje svoje lastne like.",
            "sq": "Kjo lojë është një lojë me shumë lojtarë me një skenë të përgatitur me një sallë të gatshme për t'u lejuar lojtarëve të bashkohen me lojën.\n\nDo të shohim se si të lejojmë çdo lojtar online të kontrollojë karakteret e tyre.",
            "uk": "Ця гра є багатокористувацькою грою з готовою сценою лобі, яка дозволяє гравцям приєднатися до гри.\n\nМи побачимо, як дозволити кожному онлайн-гравцю керувати своїми персонажами.",
            "zh": "这是一款多人游戏，配有预制的大厅场景，可以让玩家加入游戏。\n\n我们将看到如何让每个在线玩家控制他们自己的角色。"
          }
        }
      },
      "nextStepTrigger": {
        "clickOnTooltipButton": {
          "messageByLocale": {
            "en": "Let's go!",
            "fr": "C'est parti !",
            "ar": "لنبدأ!",
            "de": "Los geht's!",
            "es": "¡Vamos!",
            "it": "Andiamo!",
            "tr": "Haydi başlayalım!",
            "ja": "さあ、始めましょう！",
            "ko": "출발!",
            "pl": "Zaczynamy!",
            "pt": "Vamos lá!",
            "ru": "Поехали!",
            "sl": "Gremo!",
            "sq": "Hajde shkojme!",
            "th": "ไปกันเลย!",
            "uk": "Почнемо!",
            "zh": "让我们开始吧！"
          }
        }
      }
    },
    {
      "elementToHighlightId": "#toolbar-preview-split-menu-button",
      "tooltip": {
        "placement": "bottom",
        "description": {
          "messageByLocale": {
            "en": "First, let's configure the preview to always launch from the lobby scene, as this will help us test our game easily.\n\nClick on the **down arrow** next of the Preview button, then click **Use this scene to start all previews**.",
            "fr": "Tout d'abord, configurons l'aperçu pour qu'il se lance toujours à partir de la scène de lobby, car cela nous aidera à tester notre jeu facilement.\n\nCliquez sur la **flèche vers le bas** à côté du bouton Aperçu, puis cliquez sur **Utiliser cette scène pour démarrer tous les aperçus**.",
            "ar": "أولاً، دعونا نقوم بتكوين المعاينة لتشغيلها دائمًا من مشهد اللوبي، حيث سيساعدنا هذا في اختبار لعبتنا بسهولة.\n\nانقر على **السهم السفلي** بجوار زر المعاينة، ثم انقر على **استخدام هذا المشهد لبدء جميع المعاينات**.",
            "de": "Konfigurieren wir zuerst die Vorschau so, dass sie immer von der Lobby-Szene aus gestartet wird, da uns dies dabei hilft, unser Spiel leicht zu testen.\n\nKlicken Sie auf den **Pfeil nach unten** neben der Schaltfläche Vorschau und dann auf **Verwenden Sie diese Szene, um alle Vorschauen zu starten**.",
            "es": "Primero, configuremos la vista previa para que siempre se inicie desde la escena del lobby, ya que esto nos ayudará a probar nuestro juego fácilmente.\n\nHaz clic en la **flecha hacia abajo** junto al botón de Vista previa, y luego haz clic en **Usar esta escena para iniciar todas las vistas previas**.",
            "it": "Innanzitutto, configuriamo l'anteprima in modo che venga sempre avviata dalla scena della lobby, poiché ciò ci aiuterà a testare facilmente il nostro gioco.\n\nFai clic sulla **freccia in basso** accanto al pulsante Anteprima, quindi fai clic su **Usa questa scena per avviare tutte le anteprime**.",
            "tr": "Öncelikle, önizlemeyi her zaman lobiden başlatmak üzere yapılandıralım, çünkü bu, oyunumuzu kolayca test etmemize yardımcı olacaktır.\n\nÖnizleme düğmesinin yanındaki **aşağı ok** simgesine tıklayın, ardından **Tüm önizlemeleri başlatmak için bu sahneyi kullan**'ı tıklayın.",
            "ja": "まず、プレビューを常にロビーシーンから起動するように構成しましょう。これにより、ゲームを簡単にテストできます。\n\nプレビューボタンの隣にある**下向き矢印**をクリックし、**このシーンを使用してすべてのプレビューを開始**をクリックします。",
            "ko": "먼저 미리보기를 항상 로비 장면에서 시작하도록 구성하겠습니다. 이렇게 하면 게임을 쉽게 테스트할 수 있습니다.\n\n미리보기 버튼 옆의 **아래쪽 화살표**를 클릭한 다음 **모든 미리보기 시작에 이 씬 사용**을 클릭하세요.",
            "pl": "Najpierw skonfigurujmy podgląd tak, aby zawsze uruchamiał się z sceny lobby, co ułatwi nam testowanie gry.\n\nKliknij **strzałkę w dół** obok przycisku Podgląd, a następnie kliknij **Użyj tej sceny do uruchamiania wszystkich podglądów**.",
            "pt": "Primeiro, vamos configurar a visualização para sempre iniciar a partir da cena do lobby, pois isso nos ajudará a testar nosso jogo facilmente.\n\nClique na **seta para baixo** ao lado do botão de Visualização e, em seguida, clique em **Usar esta cena para iniciar todas as visualizações**.",
            "th": "เริ่มต้นด้วยการกำหนดค่าการแสดงตัวอย่างให้เริ่มต้นจากฉากล็อบบี้เสมอ เนื่องจากนี่จะช่วยให้เราทดสอบเกมได้อย่างง่ายดาย\n\nคลิกที่ **ลูกศรลง** ข้างขวาปุ่มแสดงตัวอย่าง จากนั้นคลิกที่ **ใช้ฉากนี้เพื่อเริ่มต้นแสดงตัวอย่างทั้งหมด**",
            "ru": "Сначала давайте настроим предварительный просмотр так, чтобы он всегда запускался из сцены лобби, так как это поможет нам легко тестировать нашу игру.\n\nНажмите на **стрелку вниз** рядом с кнопкой Предварительный просмотр, затем нажмите **Использовать эту сцену для запуска всех предварительных просмотров**.",
            "sl": "Najprej konfigurirajmo predogled, da se vedno začne iz prizorišča predprostora, saj nam bo to pomagalo enostavno preizkusiti našo igro.\n\nKliknite na **puščico navzdol** ob gumbu Predogled, nato kliknite **Uporabi to sceno za zagon vseh predogledov**.",
            "sq": "Fillimisht, le të konfigurojmë paraparjen që të nisë gjithmonë nga skena e sallës së pritjes, pasi kjo do të na ndihmojë të testojmë lojën tonë lehtë.\n\nKlikoni mbi **shigjetën poshtë** pranë butonit Paraparje, pastaj klikoni **Përdor këtë skenë për të filluar të gjitha paraparjet**.",
            "uk": "Спочатку давайте налаштуємо попередній перегляд так, щоб він завжди запускався з сцени лобі, оскільки це допоможе нам легко тестувати нашу гру.\n\nНатисніть на **стрілку вниз** поряд з кнопкою Попередній перегляд, а потім натисніть **Використовувати цю сцену для запуску всіх попередніх переглядів**.",
            "zh": "首先，让我们配置预览，使其始终从大厅场景启动，这将帮助我们轻松测试游戏。\n\n点击预览按钮旁边的**向下箭头**，然后点击**使用此场景启动所有预览**。"
          }
        }
      },
      "nextStepTrigger": {
        "clickOnTooltipButton": {
          "messageByLocale": {
            "en": "Done!",
            "fr": "Fait !",
            "ar": "تم!",
            "de": "Fertig!",
            "es": "¡Hecho!",
            "it": "Fatto!",
            "tr": "Tamamlandı!",
            "ja": "完了！",
            "ko": "완료!",
            "pl": "Zrobione!",
            "pt": "Concluído!",
            "th": "เสร็จสิ้น!",
            "ru": "Готово!",
            "sl": "Končano!",
            "sq": "U bë!",
            "uk": "Готово!",
            "zh": "完成！"
          }
        }
      }
    },
    {
      "id": "SwitchToGameScene",
      "elementToHighlightId": "editorTab:GameScene:Scene",
      "nextStepTrigger": {
        "editorIsActive": "GameScene:Scene"
      },
      "tooltip": {
        "description": {
          "messageByLocale": {
            "en": "Open the $(GameScene) editor.",
            "fr": "Ouvrez l'éditeur $(GameScene).",
            "ar": "افتح محرر $(GameScene).",
            "de": "Öffnen Sie den $(GameScene)-Editor.",
            "es": "Abre el editor de $(GameScene).",
            "it": "Apri l'editor di $(GameScene).",
            "tr": "$(GameScene) düzenleyicisini açın.",
            "ja": "$(GameScene)エディターを開きます。",
            "ko": "$(GameScene) 편집기를 엽니다.",
            "pl": "Otwórz edytor $(GameScene).",
            "pt": "Abra o editor de $(GameScene).",
            "th": "เปิดตัวแก้ไข $(GameScene)",
            "ru": "Откройте редактор $(GameScene).",
            "sl": "Odprite urejevalnik $(GameScene).",
            "sq": "Hapni redaktorin $(GameScene).",
            "uk": "Відкрийте редактор $(GameScene).",
            "zh": "打开 $(GameScene) 编辑器。"
          }
        }
      }
    },
    {
      "metaKind": "add-behavior",
      "objectKey": "Player1",
      "isOnClosableDialog": true,
      "behaviorListItemId": "#behavior-item-Multiplayer--MultiplayerObjectBehavior",
      "behaviorParameterPanelId": "#behavior-parameters-MultiplayerObject",
      "objectHighlightDescription": {
        "messageByLocale": {
          "en": "Let's add the multiplayer behavior to the **$(Player1)** object.\n\nClick on the 3 dot menu, or right-click on **$(Player1)**, and select **Edit behaviors**.",
          "fr": "Ajoutons le comportement multijoueur à l'objet **$(Player1)**.\n\nCliquez sur le menu à trois points, ou faites un clic droit sur **$(Player1)**, et sélectionnez **Modifier les comportements**.",
          "ar": "لنضيف سلوك اللعب الجماعي إلى كائن **$(Player1)**.\n\nانقر على قائمة النقاط الثلاثة، أو انقر بزر الماوس الأيمن على **$(Player1)**، واختر **تحرير السلوك**.",
          "de": "Fügen wir das Mehrspieler-Verhalten zum Objekt **$(Player1)** hinzu.\n\nKlicken Sie auf das 3-Punkte-Menü oder mit der rechten Maustaste auf **$(Player1)** und wählen Sie **Verhalten bearbeiten** aus.",
          "es": "Vamos a añadir el comportamiento multijugador al objeto **$(Player1)**.\n\nHaz clic en el menú de los 3 puntos, o haz clic derecho en **$(Player1)**, y selecciona **Editar comportamientos**.",
          "it": "Aggiungiamo il comportamento multiplayer all'oggetto **$(Player1)**.\n\nFai clic sul menu a 3 punti o con il pulsante destro su **$(Player1)**, e seleziona **Modifica comportamenti**.",
          "tr": "**$(Player1)** nesnesine çok oyunculu davranışı ekleyelim.\n\n3 nokta menüsüne tıklayın veya **$(Player1)** üzerinde sağ tıklayın ve **Davranışları Düzenle**'yi seçin.",
          "ja": "**$(Player1)** オブジェクトにマルチプレイヤーの動作を追加しましょう。\n\n3つの点があるメニューをクリックするか、**$(Player1)** を右クリックして **動作を編集** を選択します。",
          "ko": "**$(Player1)** 객체에 멀티플레이어 동작을 추가해 봅시다.\n\n3 점 메뉴를 클릭하거나 **$(Player1)** 에 오른쪽 클릭하고 **동작 편집**을 선택하세요.",
          "pl": "Dodajmy zachowanie wieloosobowe do obiektu **$(Player1)**.\n\nKliknij menu trzech kropek lub kliknij prawym przyciskiem myszy na **$(Player1)** i wybierz **Edytuj zachowania**.",
          "pt": "Vamos adicionar o comportamento multiplayer ao objeto **$(Player1)**.\n\nClique no menu de três pontos, ou clique com o botão direito em **$(Player1)**, e selecione **Editar comportamentos**.",
          "th": "เรามาเพิ่มพฤติกรรมแบบหลายผู้เล่นให้กับวัตถุ **$(Player1)**\n\nคลิกที่เมนูจุด 3 หรือคลิกขวาที่ **$(Player1)** และเลือก **แก้ไขพฤติกรรม**",
          "ru": "Добавим поведение для многопользовательского режима к объекту **$(Player1)**.\n\nНажмите на меню с тремя точками или щелкните правой кнопкой мыши на **$(Player1)** и выберите **Редактировать поведение**.",
          "sl": "Dodajmo večigralsko vedenje k objektu **$(Player1)**.\n\nKliknite na meni z 3 pikami ali desno kliknite na **$(Player1)** in izberite **Uredi vedenje**.",
          "sq": "Le të shtojmë sjelljen multiplayer në objektin **$(Player1)**.\n\nKlikoni në menynë me 3 pikë ose klikoni me të djathtën në **$(Player1)**, dhe zgjidhni **Redaktoni sjelljet**.",
          "uk": "Додаймо поведінку для багатокористувацького режиму до об'єкту **$(Player1)**.\n\nНатисніть на меню з трьома крапками або клацніть правою кнопкою миші на **$(Player1)** і виберіть **Редагувати поведінку**.",
          "zh": "让我们为 **$(Player1)** 对象添加多人游戏行为。\n\n点击三点菜单，或右键点击 **$(Player1)**，然后选择 **编辑行为**。"
        }
      },
      "objectHighlightTouchDescription": {
        "messageByLocale": {
          "en": "Let's add the multiplayer behavior to the $(Player1) object.\n\nSelect, then long press on **$(Player1)**, then select **Edit behaviors**.",
          "fr": "Ajoutons le comportement multijoueur à l'objet $(Player1).\n\nSélectionnez, puis appuyez longuement sur **$(Player1)**, puis sélectionnez **Modifier les comportements**.",
          "ar": "لنضيف سلوك اللاعبين المتعددين إلى كائن $(Player1).\n\nحدد، ثم اضغط بشكل طويل على **$(Player1)**، ثم اختر **تحرير السلوكيات**.",
          "de": "Fügen wir dem Objekt $(Player1) das Mehrspieler-Verhalten hinzu.\n\nWählen Sie **$(Player1)** aus, drücken Sie lange darauf und wählen Sie dann **Verhalten bearbeiten** aus.",
          "es": "Agreguemos el comportamiento multijugador al objeto $(Player1).\n\nSeleccione, luego mantenga presionado **$(Player1)** y seleccione **Editar comportamientos**.",
          "it": "Aggiungiamo il comportamento multigiocatore all'oggetto $(Player1).\n\nSeleziona, quindi tieni premuto su **$(Player1)**, quindi seleziona **Modifica comportamenti**.",
          "tr": "$(Player1) nesnesine çok oyunculu davranışı ekleyelim.\n\nSeçin, ardından **$(Player1)** üzerinde uzun basın ve **Davranışları Düzenle**'yi seçin.",
          "ja": "$(Player1)オブジェクトにマルチプレイヤー動作を追加しましょう。\n\n**$(Player1)** を選択し、長押ししてから **動作を編集** を選択してください。",
          "ko": "$(Player1) 객체에 멀티플레이어 동작을 추가해 봅시다.\n\n**$(Player1)**을(를) 선택한 다음, 길게 누르고 **행동 편집**을 선택하세요.",
          "pl": "Dodajmy zachowanie wieloosobowe do obiektu $(Player1).\n\nWybierz, następnie przytrzymaj **$(Player1)**, a następnie wybierz **Edytuj zachowania**.",
          "pt": "Vamos adicionar o comportamento multijogador ao objeto $(Player1).\n\nSelecione, em seguida, pressione longamente em **$(Player1)** e selecione **Editar comportamentos**.",
          "th": "เพิ่มพฤติกรรมที่เป็นหลายผู้เล่นให้กับวัตถุ $(Player1) \n\nเลือกแล้วกดค้างที่ **$(Player1)** แล้วเลือก **แก้ไขพฤติกรรม**",
          "ru": "Добавим поведение многопользовательской игры к объекту $(Player1).\n\nВыберите, затем удерживайте **$(Player1)** и выберите **Редактировать поведение**.",
          "sl": "Dodajmo večigralsko vedenje k predmetu $(Player1).\n\nIzberite, nato dolgo pritisnite na **$(Player1)** in izberite **Uredi vedenja**.",
          "sq": "Të shtojmë sjelljen multiplayer në objektin $(Player1).\n\nZgjidhni, pastaj mbani shtypur gjatë në **$(Player1)**, pastaj zgjidhni **Ndrysho sjelljet**.",
          "uk": "Додаймо поведінку багатокористувацької гри до об'єкту $(Player1).\n\nВиберіть, потім утримуйте **$(Player1)** і виберіть **Редагувати поведінку**.",
          "zh": "让我们给 $(Player1) 对象添加多人游戏行为。\n\n选择 **$(Player1)**，长按后选择 **编辑行为**。"
        }
      },
      "behaviorDisplayName": "**Multiplayer**",
      "parameters": [
        {
          "parameterId": "#playerNumber",
          "expectedValue": "1",
          "description": {
            "messageByLocale": {
              "en": "Let's change the ownership of the object to 1. Which will allow to connect the **$(Player1)** object with the first player to connect into the game",
              "fr": "Changeons la propriété de l'objet à 1. Cela permettra de connecter l'objet **$(Player1)** au premier joueur à se connecter au jeu.",
              "ar": "لنقم بتغيير ملكية الكائن إلى 1. والذي سيسمح بربط كائن **$(Player1)** باللاعب الأول الذي يتصل باللعبة",
              "de": "Ändern wir das Eigentum des Objekts auf 1. Dadurch wird das **$(Player1)**-Objekt mit dem ersten Spieler verbunden, der sich mit dem Spiel verbindet.",
              "es": "Cambiemos la propiedad del objeto a 1. Lo que permitirá conectar el objeto **$(Player1)** con el primer jugador que se conecte al juego.",
              "it": "Cambia la proprietà dell'oggetto a 1. Ciò permetterà di collegare l'oggetto **$(Player1)** al primo giocatore che si connette al gioco.",
              "tr": "Nesnenin sahipliğini 1 olarak değiştirelim. Bu, **$(Player1)** nesnesini oyuna bağlanan ilk oyuncuyla bağlamanıza olanak tanır.",
              "ja": "オブジェクトの所有権を1に変更しましょう。これにより、**$(Player1)** オブジェクトを最初にゲームに接続するプレイヤーに接続できます",
              "ko": "객체의 소유권을 1로 변경합시다. 이렇게 하면 **$(Player1)** 객체를 게임에 연결하는 첫 번째 플레이어와 연결할 수 있습니다.",
              "pl": "Zmienimy właścicielstwo obiektu na 1. Pozwoli to połączyć obiekt **$(Player1)** z pierwszym graczem, który dołączy do gry.",
              "pt": "Vamos alterar a propriedade do objeto para 1. Isso permitirá conectar o objeto **$(Player1)** ao primeiro jogador a se conectar ao jogo.",
              "th": "เรามาเปลี่ยนเจ้าของของวัตถุเป็น 1 ซึ่งจะช่วยให้เชื่อมต่อกับวัตถุ **$(Player1)** กับผู้เล่นคนแรกที่เชื่อมต่อเข้าสู่เกม",
              "ru": "Изменим собственность объекта на 1. Это позволит подключить объект **$(Player1)** к первому игроку, подключающемуся к игре.",
              "sl": "Spremenimo lastništvo predmeta na 1. To bo omogočilo povezavo predmeta **$(Player1)** s prvim igralcem, ki se bo povezal v igro.",
              "sq": "Le të ndryshojmë pronësinë e objektit në 1. Çka do të lejojë të lidhet objekti **$(Player1)** me lojtarin e parë që të lidhet në lojë.",
              "uk": "Змінимо власність об'єкта на 1. Це дозволить підключити об'єкт **$(Player1)** до першого гравця, який приєднується до гри.",
              "zh": "让我们将对象的所有权更改为 1。这将允许将 **$(Player1)** 对象与第一个连接到游戏的玩家连接起来。"
            }
          }
        }
      ],
      "finishedConfigurationDescription": {
        "messageByLocale": {
          "en": "That's it!\n\nNow we will add the same behavior on the **$(Player1)** object, which will be the second player to connect to the game.",
          "fr": "C'est tout !\n\nMaintenant, nous allons ajouter le même comportement à l'objet **$(Player1)**, qui sera le deuxième joueur à se connecter au jeu.",
          "ar": "هذا كل شيء!\n\nالآن سنقوم بإضافة نفس السلوك إلى كائن **$(Player1)**، الذي سيكون اللاعب الثاني للانضمام إلى اللعبة.",
          "de": "Das war's!\n\nJetzt werden wir das gleiche Verhalten dem **$(Player1)**-Objekt hinzufügen, das der zweite Spieler sein wird, der sich mit dem Spiel verbindet.",
          "es": "¡Eso es todo!\n\nAhora añadiremos el mismo comportamiento al objeto **$(Player1)**, que será el segundo jugador en conectarse al juego.",
          "it": "Ecco fatto!\n\nOra aggiungeremo lo stesso comportamento all'oggetto **$(Player1)**, che sarà il secondo giocatore a connettersi al gioco.",
          "tr": "İşte bu kadar!\n\nŞimdi **$(Player1)** nesnesine aynı davranışı ekleyeceğiz, bu da oyuna bağlanan ikinci oyuncu olacak.",
          "ja": "以上です！\n\n今度は **$(Player1)** オブジェクトに同じ動作を追加します。これはゲームに参加する2番目のプレイヤーです。",
          "ko": "그게 다입니다!\n\n이제 **$(Player1)** 객체에 동일한 동작을 추가할 것입니다. 이는 게임에 연결할 두 번째 플레이어입니다.",
          "pl": "To wszystko!\n\nTeraz dodamy to samo zachowanie do obiektu **$(Player1)**, który będzie drugim graczem dołączającym do gry.",
          "pt": "É isso aí!\n\nAgora vamos adicionar o mesmo comportamento ao objeto **$(Player1)**, que será o segundo jogador a se conectar ao jogo.",
          "th": "เป็นเช่นนี้!\n\nตอนนี้เราจะเพิ่มพฤติกรรมเดียวกันให้กับวัตถุ **$(Player1)** ซึ่งจะเป็นผู้เล่นที่สองที่เชื่อมต่อกับเกม",
          "ru": "Это всё!\n\nТеперь мы добавим то же поведение к объекту **$(Player1)**, который будет вторым игроком, подключающимся к игре.",
          "sl": "To je to!\n\nZdaj bomo dodali enako vedenje k objektu **$(Player1)**, ki bo drugi igralec, ki se bo povezal v igro.",
          "sq": "Kështu është!\n\nTani do të shtojmë sjelljen e njëjtë në objektin **$(Player1)**, që do të jetë lojtari i dytë që lidhet me lojën.",
          "uk": "Ось і все!\n\nТепер ми додамо таке ж поведінку до об'єкту **$(Player1)**, який буде другим гравцем, що приєднується до гри.",
          "zh": "就这样！\n\n现在我们将在 **$(Player1)** 对象上添加相同的行为，这将是连接到游戏的第二位玩家。"
        }
      }
    },
    {
      "metaKind": "add-behavior",
      "objectKey": "Player2",
      "isOnClosableDialog": true,
      "behaviorListItemId": "#behavior-item-Multiplayer--MultiplayerObjectBehavior",
      "behaviorParameterPanelId": "#behavior-parameters-MultiplayerObject",
      "objectHighlightDescription": {
        "messageByLocale": {
          "en": "Let's add the multiplayer behavior to the **$(Player2)** object.\n\nClick on the 3 dot menu, or right-click on **$(Player2)**, and select **Edit behaviors**.",
          "fr": "Ajoutons le comportement multijoueur à l'objet **$(Player2)**.\n\nCliquez sur le menu à 3 points, ou faites un clic droit sur **$(Player2)**, puis sélectionnez **Modifier les comportements**.",
          "ar": "لنضيف سلوك اللاعبين المتعددين إلى كائن **$(Player2)**.\n\nانقر فوق قائمة النقاط الثلاثة، أو انقر بزر الماوس الأيمن فوق **$(Player2)**، واختر **تحرير السلوكيات**.",
          "de": "Fügen wir das Mehrspieler-Verhalten dem Objekt **$(Player2)** hinzu.\n\nKlicken Sie auf das Menü mit den drei Punkten oder klicken Sie mit der rechten Maustaste auf **$(Player2)** und wählen Sie **Verhalten bearbeiten** aus.",
          "es": "Agreguemos el comportamiento multijugador al objeto **$(Player2)**.\n\nHaz clic en el menú de los 3 puntos, o haz clic derecho en **$(Player2)**, y selecciona **Editar comportamientos**.",
          "it": "Aggiungiamo il comportamento multigiocatore all'oggetto **$(Player2)**.\n\nFai clic sul menu a 3 punti, o clicca con il pulsante destro su **$(Player2)**, e seleziona **Modifica comportamenti**.",
          "tr": "**$(Player2)** nesnesine çok oyunculu davranışı ekleyelim.\n\n3 nokta menüsüne tıklayın veya **$(Player2)** üzerinde sağ tıklayın ve **Davranışları Düzenle**'yi seçin.",
          "ja": "**$(Player2)** オブジェクトにマルチプレイヤー動作を追加しましょう。\n\n3点メニューをクリックするか、**$(Player2)** を右クリックして、**動作を編集** を選択してください。",
          "ko": "**$(Player2)** 객체에 멀티플레이어 동작을 추가해 봅시다.\n\n3 점 메뉴를 클릭하거나 **$(Player2)**을(를) 마우스 오른쪽 클릭한 후 **행동 편집**을 선택하세요.",
          "pl": "Dodajmy zachowanie wieloosobowe do obiektu **$(Player2)**.\n\nKliknij w menu trzech kropek lub kliknij prawym przyciskiem myszy na **$(Player2)** i wybierz **Edytuj zachowania**.",
          "pt": "Vamos adicionar o comportamento multijogador ao objeto **$(Player2)**.\n\nClique no menu de três pontos, ou clique com o botão direito em **$(Player2)**, e selecione **Editar comportamentos**.",
          "th": "เรามาเพิ่มพฤติกรรมที่เป็นหลายผู้เล่นให้กับวัตถุ **$(Player2)**\n\nคลิกที่เมนู 3 จุดหรือคลิกขวาที่ **$(Player2)** แล้วเลือก **แก้ไขพฤติกรรม**",
          "ru": "Добавим поведение многопользовательской игры к объекту **$(Player2)**.\n\nНажмите на меню с тремя точками или щелкните правой кнопкой мыши на **$(Player2)** и выберите **Редактировать поведение**.",
          "sl": "Dodajmo večigralsko vedenje k predmetu **$(Player2)**.\n\nKliknite na meniju s tremi pikami ali desno kliknite na **$(Player2)** in izberite **Uredi vedenja**.",
          "sq": "Të shtojmë sjelljen multiplayer në objektin **$(Player2)**.\n\nKlikoni në menunë e 3 pikave, ose klikoni me të djathtën në **$(Player2)**, dhe zgjidhni **Ndrysho sjelljet**.",
          "uk": "Додаймо поведінку багатокористувацької гри до об'єкту **$(Player2)**.\n\nКлацніть на меню з трьома крапками або правою кнопкою миші на **$(Player2)** і виберіть **Редагувати поведінку**.",
          "zh": "让我们给 **$(Player2)** 对象添加多人游戏行为。\n\n点击三点菜单，或者右键点击 **$(Player2)**，然后选择 **编辑行为**。"
        }
      },
      "objectHighlightTouchDescription": {
        "messageByLocale": {
          "en": "Let's add the multiplayer behavior to the $(Player2) object.\n\nSelect, then long press on **$(Player2)**, then select **Edit behaviors**.",
          "fr": "Ajoutons le comportement multijoueur à l'objet $(Player2).\n\nSélectionnez, puis appuyez longuement sur **$(Player2)**, puis sélectionnez **Modifier les comportements**.",
          "ar": "لنضيف سلوك اللعب الجماعي إلى كائن $(Player2).\n\nحدد، ثم اضغط بالضغط المطول على **$(Player2)**، ثم حدد **تعديل السلوك**.",
          "de": "Lassen Sie uns das Mehrspieler-Verhalten zum $(Player2)-Objekt hinzufügen.\n\nWählen Sie **$(Player2)** aus, drücken Sie lange darauf und wählen Sie dann **Verhalten bearbeiten** aus.",
          "es": "Vamos a añadir el comportamiento multijugador al objeto $(Player2).\n\nSelecciona, luego mantén pulsado en **$(Player2)**, luego selecciona **Editar comportamientos**.",
          "it": "Aggiungiamo il comportamento multiplayer all'oggetto $(Player2).\n\nSeleziona, quindi premi a lungo su **$(Player2)**, quindi seleziona **Modifica comportamenti**.",
          "tr": "$(Player2) nesnesine çok oyunculu davranışı ekleyelim.\n\nSeçin, ardından **$(Player2)** üzerinde uzun basın ve **Davranışları Düzenle**'yi seçin.",
          "ja": "$(Player2) オブジェクトにマルチプレイヤーの動作を追加しましょう。\n\n**$(Player2)** を選択し、長押ししてから **動作を編集** を選択します。",
          "ko": "$(Player2) 객체에 멀티플레이어 동작을 추가해 봅시다.\n\n**$(Player2)** 을(를) 선택한 다음, 길게 누르고 **동작 편집**을 선택하세요.",
          "pl": "Dodajmy zachowanie wieloosobowe do obiektu $(Player2).\n\nWybierz, następnie przytrzymaj długo na **$(Player2)**, a następnie wybierz **Edytuj zachowania**.",
          "pt": "Vamos adicionar o comportamento multiplayer ao objeto $(Player2).\n\nSelecione, então mantenha pressionado em **$(Player2)**, depois selecione **Editar comportamentos**.",
          "th": "เรามาเพิ่มพฤติกรรมแบบหลายผู้เล่นให้กับวัตถุ $(Player2)\n\nเลือกแล้วกดค้างที่ **$(Player2)** จากนั้นเลือก **แก้ไขพฤติกรรม**",
          "ru": "Добавим поведение для многопользовательского режима к объекту $(Player2).\n\nВыберите, затем удерживайте долго на **$(Player2)**, затем выберите **Редактировать поведение**.",
          "sl": "Dodajmo večigralsko vedenje k objektu $(Player2).\n\nIzberite, nato dolgo pritisnite na **$(Player2)**, nato izberite **Uredi vedenje**.",
          "sq": "Le të shtojmë sjelljen multiplayer në objektin $(Player2).\n\nZgjidh, pastaj shtypni gjatë në **$(Player2)**, pastaj zgjidh **Redaktoni sjelljet**.",
          "uk": "Додаймо поведінку для багатокористувацького режиму до об'єкту $(Player2).\n\nВиберіть, потім тримайте довго на **$(Player2)**, потім виберіть **Редагувати поведінку**.",
          "zh": "让我们为 $(Player2) 对象添加多人游戏行为。\n\n选择，然后长按 **$(Player2)**，然后选择 **编辑行为**。"
        }
      },
      "behaviorDisplayName": "**Multiplayer**",
      "parameters": [
        {
          "parameterId": "#playerNumber",
          "expectedValue": "2",
          "description": {
            "messageByLocale": {
              "en": "Let's change the ownership of the object to 2. Which will allow to connect the **$(Player2)** object with the second player to connect into the game",
              "fr": "Modifions la propriété de l'objet à 2. Cela permettra de connecter l'objet **$(Player2)** au deuxième joueur à se connecter au jeu.",
              "ar": "لنقم بتغيير ملكية الكائن إلى 2. مما سيسمح بربط كائن **$(Player2)** باللاعب الثاني الذي يتصل باللعبة.",
              "de": "Ändern wir das Eigentum des Objekts auf 2. Dies wird es ermöglichen, das **$(Player2)**-Objekt mit dem zweiten Spieler zu verbinden, der sich im Spiel anmeldet.",
              "es": "Cambiamos la propiedad del objeto en 2. Lo que permitirá conectar el objeto **$(Player2)** con el segundo jugador que se conecte al juego.",
              "it": "Cambia la proprietà dell'oggetto in 2. Questo permetterà di collegare l'oggetto **$(Player2)** al secondo giocatore che si connette al gioco.",
              "tr": "Nesnenin sahipliğini 2 olarak değiştirelim. Bu, **$(Player2)** nesnesini oyuna bağlanan ikinci oyuncuyla bağlamanıza olanak tanır.",
              "ja": "オブジェクトの所有権を2に変更しましょう。これにより、**$(Player2)** オブジェクトがゲームに接続する2番目のプレイヤーと接続できるようになります。",
              "ko": "객체의 소유권을 2로 변경합시다. 이는 **$(Player2)** 객체를 게임에 두 번째로 연결된 플레이어와 연결할 수 있게 할 것입니다.",
              "pl": "Zmienimy właśność obiektu na 2. Pozwoli to połączyć obiekt **$(Player2)** z drugim graczem, który połączy się z grą.",
              "pt": "Vamos alterar a propriedade do objeto em 2. Isso permitirá conectar o objeto **$(Player2)** ao segundo jogador a se conectar no jogo.",
              "th": "เรามาเปลี่ยนการเป็นเจ้าของของวัตถุด้วย 2 ซึ่งจะช่วยให้เชื่อมต่อกับวัตถุ **$(Player2)** กับผู้เล่นคนที่สองที่เชื่อมต่อเข้าสู่เกมได้",
              "ru": "Давайте изменим собственность объекта на 2. Это позволит связать объект **$(Player2)** со вторым игроком, подключившимся к игре.",
              "sl": "Spremenimo lastništvo predmeta za 2. To bo omogočilo povezavo predmeta **$(Player2)** z drugim igralcem, ki se poveže v igro.",
              "sq": "Le të ndryshojmë pronësinë e objektit me 2. Kjo do të lejojë të lidhet objekti **$(Player2)** me lojtarin e dytë që lidhet në lojë.",
              "uk": "Змінимо власність об'єкта на 2. Це дозволить підключити об'єкт **$(Player2)** до другого гравця, який приєднався до гри.",
              "zh": "让我们将对象的所有权改为2。这将允许将 **$(Player2)** 对象与第二位连接到游戏中的玩家连接起来。"
            }
          }
        }
      ],
      "finishedConfigurationDescription": {
        "messageByLocale": {
          "en": "That's it for the objects!\n\nNow we will let online players control their own object by adding some logic into the eventsheet.",
          "fr": "C'est tout pour les objets !\n\nMaintenant, nous permettrons aux joueurs en ligne de contrôler leur propre objet en ajoutant de la logique dans la feuille d'événements.",
          "ar": "هذا كل شيء بالنسبة للكائنات!\n\nالآن سنسمح للاعبين عبر الإنترنت بالتحكم في كائناتهم الخاصة عن طريق إضافة بعض المنطق إلى ورقة الأحداث.",
          "de": "Das war's mit den Objekten!\n\nJetzt werden wir es den Online-Spielern ermöglichen, ihre eigenen Objekte zu steuern, indem wir einige Logik in das Ereignisblatt einfügen.",
          "es": "¡Eso es todo por los objetos!\n\nAhora permitiremos que los jugadores en línea controlen su propio objeto añadiendo algo de lógica en la hoja de eventos.",
          "it": "Questo è tutto per gli oggetti!\n\nOra permetteremo ai giocatori online di controllare il proprio oggetto aggiungendo della logica nel foglio degli eventi.",
          "tr": "Nesneler için bu kadar!\n\nŞimdi online oyuncuların kendi nesnelerini kontrol etmelerine izin vermek için etkinlik tablosuna bazı mantık ekleyeceğiz.",
          "ja": "これでオブジェクトに関する作業は完了です！\n\nさて、イベントシートにいくつかのロジックを追加することで、オンラインプレイヤーが自分のオブジェクトを制御できるようにします。",
          "ko": "이로써 객체에 대한 작업은 마무리입니다!\n\n이제 이벤트 시트에 몇 가지 논리를 추가하여 온라인 플레이어가 자신의 객체를 제어할 수 있게 할 것입니다.",
          "pl": "To wszystko, jeśli chodzi o obiekty!\n\nTeraz pozwolimy graczom online kontrolować własne obiekty, dodając pewną logikę do arkusza zdarzeń.",
          "pt": "É isso para os objetos!\n\nAgora vamos permitir que os jogadores online controlem seu próprio objeto adicionando alguma lógica na planilha de eventos.",
          "th": "นั่นคืออะไรสำหรับวัตถุ!\n\nตอนนี้เราจะให้ผู้เล่นทางออนไลน์ควบคุมวัตถุของตัวเองได้โดยการเพิ่มตัวตนในแผ่นเหตุการณ์",
          "ru": "Это все для объектов!\n\nТеперь мы позволим онлайн-игрокам контролировать свои собственные объекты, добавив некоторую логику в таблицу событий.",
          "sl": "To je vse za objekte!\n\nZdaj bomo omogočili spletnim igralcem, da nadzorujejo svoje lastne objekte z dodajanjem nekaj logike v dogodkovni list.",
          "sq": "Kështu që për objektet!\n\nTani do t'u lejojmë lojtarëve në linjë të kontrollojnë objektin e tyre duke shtuar një logjikë në eventsheet.",
          "uk": "Ось і все для об'єктів!\n\nТепер ми дозволимо онлайн-гравцям контролювати свої власні об'єкти, додавши деяку логіку до eventsheet.",
          "zh": "对象部分就到这里！\n\n现在我们将通过在事件表中添加一些逻辑，让在线玩家可以控制他们自己的对象。"
        }
      }
    },
    {
      "id": "SwitchToEvents1",
      "elementToHighlightId": "editorTab:GameScene:EventsSheet",
      "nextStepTrigger": {
        "editorIsActive": "GameScene:EventsSheet"
      },
      "tooltip": {
        "description": {
          "messageByLocale": {
            "en": "Open the events sheet.",
            "fr": "Ouvrez la feuille des événements.",
            "ar": "افتح ورقة الأحداث.",
            "de": "Öffnen Sie das Ereignisblatt.",
            "es": "Abre la hoja de eventos.",
            "it": "Apri il foglio degli eventi.",
            "tr": "Olay tablosunu açın.",
            "ja": "イベントシートを開く。",
            "ko": "이벤트 시트를 엽니다.",
            "pl": "Otwórz arkusz zdarzeń.",
            "pt": "Abra a planilha de eventos.",
            "th": "เปิดแผ่นงานเหตุการณ์",
            "ru": "Откройте лист событий.",
            "sl": "Odpri dogodkovni list.",
            "sq": "Hapni fletën e ngjarjeve.",
            "uk": "Відкрийте аркуш подій.",
            "zh": "打开事件表。"
          }
        }
      }
    },
    {
      "elementToHighlightId": "#events-editor[data-active] #event-1-1-conditions #add-condition-button-empty",
      "nextStepTrigger": {
        "presenceOfElement": "#instruction-editor-dialog"
      },
      "tooltip": {
        "description": {
          "messageByLocale": {
            "en": "Thanks to the previously added behavior on the **$(Player1)** and **$(Player2)** objects, new conditions are available on these two objects.\n\nTo reduce the number of conditions, we've placed these objects in an **Object Group** named **PlayerObjects**.\n\nLet's add a new condition that will check if the objects from the group are owned by the right player.",
            "fr": "Grâce aux comportements précédemment ajoutés sur les objets **$(Player1)** et **$(Player2)**, de nouvelles conditions sont disponibles sur ces deux objets.\n\nPour réduire le nombre de conditions, nous avons placé ces objets dans un **Groupe d'objets** nommé **PlayerObjects**.\n\nAjoutons une nouvelle condition qui vérifiera si les objets du groupe sont possédés par le bon joueur.",
            "ar": "بفضل السلوكيات المضافة سابقاً على أشياء **$(Player1)** و **$(Player2)** ، تتوفر شروط جديدة على هاتين الكائنتين.\n\nلتقليل عدد الشروط ، قمنا بوضع هذه الكائنات في **مجموعة كائنات** تحت اسم **PlayerObjects**.\n\nلنضيف شرطًا جديدًا سيتحقق مما إذا كانت الكائنات من المجموعة تمتلكها اللاعب الصحيح.",
            "de": "Dank des zuvor hinzugefügten Verhaltens auf den Objekten **$(Player1)** und **$(Player2)** stehen neue Bedingungen für diese beiden Objekte zur Verfügung.\n\nUm die Anzahl der Bedingungen zu reduzieren, haben wir diese Objekte in einer **Objektgruppe** namens **PlayerObjects** platziert.\n\nLassen Sie uns eine neue Bedingung hinzufügen, die überprüft, ob die Objekte aus der Gruppe dem richtigen Spieler gehören.",
            "es": "Gracias al comportamiento previamente añadido en los objetos **$(Player1)** y **$(Player2)**, ahora hay nuevas condiciones disponibles para estos dos objetos.\n\nPara reducir el número de condiciones, hemos colocado estos objetos en un **Grupo de Objetos** llamado **PlayerObjects**.\n\nVamos a añadir una nueva condición que verificará si los objetos del grupo son propiedad del jugador correcto.",
            "it": "Grazie al comportamento aggiunto in precedenza sugli oggetti **$(Player1)** e **$(Player2)**, sono disponibili nuove condizioni su questi due oggetti.\n\nPer ridurre il numero di condizioni, abbiamo inserito questi oggetti in un **Gruppo di Oggetti** chiamato **PlayerObjects**.\n\nAggiungiamo una nuova condizione che verificherà se gli oggetti del gruppo sono di proprietà del giocatore corretto.",
            "tr": "Önceki olarak **$(Player1)** ve **$(Player2)** nesnelerine eklenen davranışlar sayesinde, bu iki nesne üzerinde yeni koşullar mevcut.\n\nKoşulların sayısını azaltmak için bu nesneleri **PlayerObjects** adlı bir **Nesne Grubu**'na yerleştirdik.\n\nBu gruptaki nesnelerin doğru oyuncuya ait olup olmadığını kontrol edecek yeni bir koşul ekleyelim.",
            "ja": "**$(Player1)** および **$(Player2)** オブジェクトに以前追加した動作のおかげで、これらの2つのオブジェクトに新しい条件が利用可能になりました。\n\n条件の数を減らすために、これらのオブジェクトを **PlayerObjects** という名前の **オブジェクトグループ** に配置しました。\n\nグループ内のオブジェクトが正しいプレイヤーの所有物であるかどうかをチェックする新しい条件を追加しましょう。",
            "ko": "**$(Player1)** 및 **$(Player2)** 객체에 이전에 추가된 동작 덕분에, 이 두 객체에 새로운 조건이 가능해졌습니다.\n\n조건의 수를 줄이기 위해 이 객체들을 **PlayerObjects**라는 **객체 그룹**에 넣었습니다.\n\n이 그룹의 객체가 올바른 플레이어에 의해 소유되었는지 확인할 새로운 조건을 추가해 봅시다.",
            "pl": "Dzięki wcześniej dodanym zachowaniom na obiektach **$(Player1)** i **$(Player2)**, dostępne są nowe warunki dla tych dwóch obiektów.\n\nAby zmniejszyć liczbę warunków, umieściliśmy te obiekty w **Grupie Obiektów** o nazwie **PlayerObjects**.\n\nDodajmy nowy warunek, który sprawdzi, czy obiekty z grupy są własnością właściwego gracza.",
            "pt": "Graças ao comportamento previamente adicionado nos objetos **$(Player1)** e **$(Player2)**, novas condições estão disponíveis para esses dois objetos.\n\nPara reduzir a quantidade de condições, colocamos esses objetos em um **Grupo de Objetos** chamado **PlayerObjects**.\n\nVamos adicionar uma nova condição que verificará se os objetos do grupo são de propriedade do jogador correto.",
            "th": "ด้วยความขอบคุณต่อพฤติกรรมที่เพิ่มไว้ก่อนหน้านี้บนวัตถุ **$(Player1)** และ **$(Player2)** ตอนนี้มีเงื่อนไขใหม่ที่สามารถใช้ได้บนวัตถุสองตัวนี้\n\nเพื่อลดจำนวนเงื่อนไขเราได้วางวัตถุเหล่านี้ไว้ใน **กลุ่มวัตถุ** ชื่อ **PlayerObjects**\n\nเรามาเพิ่มเงื่อนไขใหม่ที่จะตรวจสอบว่าวัตถุจากกลุ่มนี้เป็นเจ้าของของผู้เล่นที่ถูกต้อง",
            "ru": "Благодаря предварительно добавленному поведению на объектах **$(Player1)** и **$(Player2)** появились новые условия для этих двух объектов.\n\nЧтобы сократить количество условий, мы поместили эти объекты в **Группу объектов** с именем **PlayerObjects**.\n\nДобавим новое условие, которое проверит, принадлежат ли объекты из группы правильному игроку.",
            "sl": "Zahvaljujoč prej dodanemu vedenju na predmetih **$(Player1)** in **$(Player2)**, so na teh dveh predmetih na voljo novi pogoji.\n\nDa zmanjšamo število pogojev, smo te predmete postavili v **Skupino predmetov** imenovano **PlayerObjects**.\n\nDodajmo nov pogoj, ki bo preveril, ali so predmeti iz skupine last lastniku.",
            "sq": "Falë veprimeve të shtuara më parë në objektet **$(Player1)** dhe **$(Player2)**, janë në dispozicion kushte të reja për këto dy objekte.\n\nPër të zvogëluar numrin e kushteve, kemi vendosur këto objekte në një **Grup** **Objekt** të quajtur **PlayerObjects**.\n\nLe të shtojmë një kusht të ri që do të kontrollojë nëse objektet nga grupi janë të pronësisë së lojtarit të duhur.",
            "uk": "Завдяки раніше доданому поведінці на об'єктах **$(Player1)** і **$(Player2)**, на цих двох об'єктах доступні нові умови.\n\nЩоб зменшити кількість умов, ми розмістили ці об'єкти в **Групу об'єктів** під назвою **PlayerObjects**.\n\nДодаймо нову умову, яка перевірить, чи належать об'єкти з групи правильному гравцеві.",
            "zh": "由于先前在 **$(Player1)** 和 **$(Player2)** 对象上添加的行为，这两个对象上现在有了新的条件可用。\n\n为了减少条件的数量，我们将这些对象放置在名为 **PlayerObjects** 的 **对象组** 中。\n\n让我们添加一个新条件，检查组中的对象是否由正确的玩家拥有。"
          }
        }
      }
    },
    {
      "elementToHighlightId": "div[data-object-name=PlayerObjects]",
      "nextStepTrigger": {
        "presenceOfElement": "#object-instruction-selector"
      },
      "tooltip": {
        "description": {
          "messageByLocale": {
            "en": "Select this object group, it contains our **$(Player1)** and **$(Player2)** objects.",
            "fr": "Sélectionnez ce groupe d'objets, il contient nos objets **$(Player1)** et **$(Player2)**.",
            "ar": "اختر مجموعة الكائنات هذه، فهي تحتوي على كائناتنا **$(Player1)** و **$(Player2)**.",
            "de": "Wählen Sie diese Objektgruppe aus, sie enthält unsere **$(Player1)** und **$(Player2)** Objekte.",
            "es": "Selecciona este grupo de objetos, contiene nuestros objetos **$(Player1)** y **$(Player2)**.",
            "it": "Seleziona questo gruppo di oggetti, contiene i nostri oggetti **$(Player1)** e **$(Player2)**.",
            "tr": "Bu nesne grubunu seçin, içinde **$(Player1)** ve **$(Player2)** nesnelerimiz bulunmaktadır.",
            "ja": "このオブジェクトグループを選択してください。ここには私たちの **$(Player1)** と **$(Player2)** のオブジェクトが含まれています。",
            "ko": "이 객체 그룹을 선택하세요, 여기에는 **$(Player1)** 와 **$(Player2)** 객체가 포함되어 있습니다.",
            "pl": "Wybierz tę grupę obiektów, zawiera nasze obiekty **$(Player1)** i **$(Player2)**.",
            "pt": "Selecione este grupo de objetos, ele contém nossos objetos **$(Player1)** e **$(Player2)**.",
            "th": "เลือกกลุ่มวัตถุนี้ มันประกอบด้วยวัตถุ **$(Player1)** และ **$(Player2)** ของเรา",
            "ru": "Выберите эту группу объектов, она содержит наши объекты **$(Player1)** и **$(Player2)**.",
            "sl": "Izberite to skupino objektov, ki vsebuje naše **$(Player1)** in **$(Player2)** objekte.",
            "sq": "Zgjidh grupin e këtyre objekteve, përmban objektet tona **$(Player1)** dhe **$(Player2)**.",
            "uk": "Виберіть цю групу об'єктів, вона містить наші об'єкти **$(Player1)** і **$(Player2)**.",
            "zh": "选择这个对象组，它包含我们的 **$(Player1)** 和 **$(Player2)** 对象。"
          }
        },
        "placement": "top",
        "mobilePlacement": "top"
      },
      "isOnClosableDialog": true
    },
    {
      "elementToHighlightId": "#instruction-item-Multiplayer--MultiplayerObjectBehavior--IsObjectOwnedByCurrentPlayer",
      "isOnClosableDialog": true,
      "tooltip": {
        "description": {
          "messageByLocale": {
            "en": "Select this condition.\n\nWith this condition you will check if the connected players are using the right Player1 or Player2 object from the group",
            "fr": "Sélectionnez cette condition.\n\nAvec cette condition, vous vérifierez si les joueurs connectés utilisent les bons objets Player1 ou Player2 du groupe.",
            "ar": "حدد هذا الشرط.\n\nمع هذا الشرط، ستتحقق مما إذا كان اللاعبون المتصلون يستخدمون الكائن Player1 أو Player2 الصحيح من المجموعة.",
            "de": "Wählen Sie diese Bedingung aus.\n\nMit dieser Bedingung überprüfen Sie, ob die verbundenen Spieler das richtige Player1- oder Player2-Objekt aus der Gruppe verwenden.",
            "es": "Seleccione esta condición.\n\nCon esta condición comprobará si los jugadores conectados están utilizando el objeto Player1 o Player2 correcto del grupo.",
            "it": "Seleziona questa condizione.\n\nCon questa condizione verificherai se i giocatori connessi stanno utilizzando il Player1 o Player2 corretto dal gruppo.",
            "tr": "Bu koşulu seçin.\n\nBu koşul ile bağlı oyuncuların grup içindeki doğru Player1 veya Player2 nesnesini kullanıp kullanmadığını kontrol edeceksiniz.",
            "ja": "この条件を選択します。\n\nこの条件で、接続されているプレイヤーがグループから正しいPlayer1またはPlayer2オブジェクトを使用しているかどうかを確認します。",
            "ko": "이 조건을 선택하세요.\n\n이 조건으로 연결된 플레이어가 그룹에서 올바른 Player1 또는 Player2 객체를 사용하는지 확인할 수 있습니다.",
            "pl": "Wybierz ten warunek.\n\nZ tym warunkiem sprawdzisz, czy połączeni gracze używają odpowiednich obiektów Player1 lub Player2 z grupy.",
            "pt": "Selecione esta condição.\n\nCom esta condição, você verificará se os jogadores conectados estão usando o objeto Player1 ou Player2 correto do grupo.",
            "th": "เลือกเงื่อนไขนี้\n\nด้วยเงื่อนไขนี้คุณจะตรวจสอบว่าผู้เล่นที่เชื่อมต่อกันใช้วัตถุ Player1 หรือ Player2 ที่ถูกต้องจากกลุ่มหรือไม่",
            "ru": "Выберите этот условие.\n\nС помощью этого условия вы проверите, используют ли подключенные игроки правильные объекты Player1 или Player2 из группы.",
            "sl": "Izberite to stanje.\n\nS tem stanjem boste preverili, ali povezani igralci uporabljajo pravilne predmete Player1 ali Player2 iz skupine.",
            "sq": "Zgjidhni këtë kusht.\n\nMe këtë kusht do të kontrolloni nëse lojtarët e lidhur po përdorin objektet e duhura Player1 ose Player2 nga grupi.",
            "uk": "Виберіть цей випадок.\n\nЗ цим умовою ви перевірите, чи використовують підключені гравці правильні об'єкти Player1 або Player2 з групи.",
            "zh": "选择此条件。\n\n使用此条件，您将检查连接的玩家是否正在使用组中正确的Player1或Player2对象。"
          }
        }
      },
      "nextStepTrigger": {
        "presenceOfElement": "#instruction-parameters-container"
      }
    },
    {
      "elementToHighlightId": "#ok-button",
      "isOnClosableDialog": true,
      "tooltip": {
        "description": {
          "messageByLocale": {
            "en": "That's it!",
            "fr": "C'est tout !",
            "ar": "هذا كل شيء!",
            "de": "Das war's!",
            "es": "¡Eso es todo!",
            "it": "È tutto!",
            "tr": "Bu kadar!",
            "ja": "以上です！",
            "ko": "그게 다입니다!",
            "pl": "To wszystko!",
            "pt": "É isso!",
            "th": "เสร็จสิ้นแล้ว!",
            "ru": "Вот и всё!",
            "sl": "To je to!",
            "sq": "Kështu është!",
            "uk": "Ось і все!",
            "zh": "就这样！"
          }
        }
      },
      "nextStepTrigger": {
        "absenceOfElement": "#instruction-editor-dialog"
      }
    },
    {
      "elementToHighlightId": "#toolbar-preview-split-menu-button",
      "tooltip": {
        "description": {
          "messageByLocale": {
            "en": "We're done! Let's test our game in multiple previews to emulate two online players!\n\nClick on the **down arrow**, then click **Launch preview in...** > **2 previews in 2 windows**",
            "fr": "Nous avons terminé ! Testons notre jeu avec plusieurs prévisualisations pour simuler deux joueurs en ligne !\n\nCliquez sur la **flèche vers le bas**, puis cliquez sur **Lancer la prévisualisation dans...** > **2 prévisualisations dans 2 fenêtres**",
            "ar": "لقد انتهينا! دعونا نختبر لعبتنا في عدة معاينات لنحاكي لاعبين اثنين عبر الإنترنت!\n\nانقر على **السهم الأسفل**, ثم انقر **تشغيل المعاينة في...** > **2 معاينات في 2 نوافذ**",
            "de": "Wir sind fertig! Testen wir unser Spiel in mehreren Vorschauen, um zwei Online-Spieler zu simulieren!\n\nKlicken Sie auf den **Abwärtspfeil**, dann auf **Vorschau starten in...** > **2 Vorschauen in 2 Fenstern**",
            "es": "¡Hemos terminado! ¡Vamos a probar nuestro juego en varias previsualizaciones para emular a dos jugadores en línea!\n\nHaz clic en la **flecha hacia abajo**, luego haz clic en **Iniciar previsualización en...** > **2 previsualizaciones en 2 ventanas**",
            "it": "Abbiamo finito! Testiamo il nostro gioco in più anteprime per emulare due giocatori online!\n\nClicca sulla **freccia in giù**, poi clicca su **Avvia anteprima in...** > **2 anteprime in 2 finestre**",
            "tr": "Bitti! İki çevrimiçi oyuncuyu taklit etmek için oyunumuzu birden fazla önizlemede test edelim!\n\n**Aşağı ok**'a tıklayın, ardından **Önizlemeyi başlat...** > **2 önizleme 2 pencere**'yi tıklayın",
            "ja": "完了です！2人のオンラインプレイヤーをエミュレートするために複数のプレビューでゲームをテストしましょう！\n\n**下向き矢印**をクリックし、次に**プレビューを起動...** > **2つのウィンドウで2つのプレビュー**をクリックします。",
            "ko": "작업을 마쳤습니다! 두 명의 온라인 플레이어를 모방하기 위해 여러 프리뷰에서 게임을 테스트해 봅시다!\n\n**아래 화살표**를 클릭한 다음 **미리보기 시작...** > **2개 창에서 2개의 미리보기**를 클릭하세요.",
            "pl": "Skończyliśmy! Przetestujmy naszą grę w wielu podglądach, aby naśladować dwóch graczy online!\n\nKliknij **strzałkę w dół**, a następnie kliknij **Uruchom podgląd w...** > **2 podglądy w 2 oknach**",
            "pt": "Terminamos! Vamos testar nosso jogo em várias pré-visualizações para simular dois jogadores online!\n\nClique na **seta para baixo**, então clique em **Iniciar pré-visualização em...** > **2 pré-visualizações em 2 janelas**",
            "th": "เราเสร็จแล้ว! มาทดสอบเกมของเราในการแสดงตัวอย่างหลายรูปแบบเพื่อจำลองผู้เล่นสองคนออนไลน์!\n\nคลิกที่ **ลูกศรลง**, จากนั้นคลิกที่ **เริ่มต้นการแสดงตัวอย่างใน...** > **2 การแสดงตัวอย่างใน 2 หน้าต่าง**",
            "ru": "Мы закончили! Давайте протестируем нашу игру в нескольких предпросмотрах, чтобы эмулировать двух онлайн игроков!\n\nНажмите на **стрелку вниз**, затем выберите **Запустить предпросмотр в...** > **2 предпросмотра в 2 окнах**",
            "sl": "To je to! Testirajmo našo igro v več predogledih, da posnemamo dva spletna igralca!\n\nKliknite na **puščico dol**, nato kliknite **Zaženi predogled v...** > **2 predogleda v 2 oknih**",
            "sq": "Kështu është! Le të testojmë lojën tonë në shumë paraparje për të imituar dy lojtarët në linjë!\n\nKlikoni në **shigjetën poshtë**, pastaj klikoni **Lansoje paraparjen në...** > **2 paraparje në 2 dritare**",
            "uk": "Ми закінчили! Давайте протестуємо нашу гру в кількох попередніх переглядах, щоб емулювати двох онлайн гравців!\n\nНатисніть на **стрілку вниз**, потім виберіть **Запустити попередній перегляд у...** > **2 попередні перегляди в 2 вікнах**",
            "zh": "完成了！让我们在多个预览中测试我们的游戏，以模拟两名在线玩家！\n\n点击 **向下箭头**，然后点击 **在...中启动预览** > **2个窗口中的2个预览**"
          }
        },
        "touchDescription": {
          "messageByLocale": {
            "en": "We're done! Let's test our game by launching a preview!",
            "fr": "Nous avons terminé ! Testons notre jeu en lançant une prévisualisation !",
            "ar": "لقد انتهينا! دعونا نختبر لعبتنا عن طريق تشغيل معاينة!",
            "de": "Wir sind fertig! Testen wir unser Spiel, indem wir eine Vorschau starten!",
            "es": "¡Hemos terminado! ¡Vamos a probar nuestro juego lanzando una previsualización!",
            "it": "Abbiamo finito! Testiamo il nostro gioco avviando una anteprima!",
            "tr": "Bitti! Bir önizleme başlatarak oyunumuzu test edelim!",
            "ja": "完了です！プレビューを起動してゲームをテストしましょう！",
            "ko": "작업을 마쳤습니다! 미리보기를 시작하여 게임을 테스트해 봅시다!",
            "pl": "Skończyliśmy! Przetestujmy naszą grę, uruchamiając podgląd!",
            "pt": "Terminamos! Vamos testar nosso jogo iniciando uma pré-visualização!",
            "th": "เราเสร็จแล้ว! มาทดสอบเกมของเราโดยการเริ่มต้นการแสดงตัวอย่าง!",
            "ru": "Мы закончили! Давайте протестируем нашу игру, запустив предпросмотр!",
            "sl": "To je to! Testirajmo našo igro z zagonom predogleda!",
            "sq": "Kështu është! Le të testojmë lojën tonë duke lansuar një paraparje!",
            "uk": "Ми закінчили! Давайте протестуємо нашу гру, запустивши попередній перегляд!",
            "zh": "完成了！让我们通过启动预览来测试我们的游戏！"
          }
        },
        "placement": "bottom",
        "mobilePlacement": "bottom"
      },
      "nextStepTrigger": {
        "previewLaunched": true
      }
    }
  ],
  "endDialog": {
    "content": [
      {
        "messageByLocale": {
          "en": "# You've finished this lesson!",
          "fr": "# Vous avez terminé cette leçon !",
          "ar": "# لقد انتهيت من هذا الدرس!",
          "de": "# Du hast diese Lektion abgeschlossen!",
          "es": "# ¡Has terminado esta lección!",
          "it": "# Hai completato questa lezione!",
          "tr": "# Bu dersi tamamladınız!",
          "ja": "# このレッスンは終了しました！",
          "ko": "# 이 레슨을 마쳤습니다!",
          "pl": "# Zakończyłeś tę lekcję!",
          "pt": "# Você terminou esta lição!",
          "th": "# คุณได้เสร็จสิ้นบทเรียนนี้แล้ว!",
          "ru": "# Вы завершили это урок!",
          "sl": "# Dokončali ste ta pouk!",
          "sq": "# Keni përfunduar këtë mësim!",
          "uk": "# Ви завершили цей урок!",
          "zh": "# 你已完成本课程！"
        }
      },
      {
        "messageByLocale": {
          "en": "Well done, in this tutorial you've learned how to:",
          "fr": "Bien joué, dans ce tutoriel vous avez appris comment :",
          "ar": "أحسنت، في هذا الدرس التعليمي تعلمت كيفية :",
          "de": "Gut gemacht, in diesem Tutorial haben Sie gelernt, wie Sie:",
          "es": "¡Bien hecho, en este tutorial has aprendido cómo:",
          "it": "Ben fatto, in questo tutorial hai imparato come:",
          "tr": "Harika, bu dersi tamamladınız ve şunları öğrendiniz:",
          "ja": "お疲れ様です、このチュートリアルでは以下の方法を学びました：",
          "ko": "잘 했어요, 이 튜토리얼에서는 다음을 배웠습니다:",
          "pl": "Dobrze wykonane, w tym samouczku nauczyłeś się, jak:",
          "pt": "Bem feito, neste tutorial você aprendeu como:",
          "th": "เก่งมาก เรียนรู้วิธีทำดังนี้ในบทแนะนำนี้",
          "ru": "Отлично сработано, в этом учебнике вы узнали, как:",
          "sl": "Dobro opravljeno, v tem vadnem programu ste se naučili, kako:",
          "sq": "Mirë, në këtë udhëzues keni mësuar si të:",
          "uk": "Добре зроблено, у цьому підручнику ви вивчили, як:",
          "zh": "干得好，在这个教程中，您学会了如何："
        }
      },
      {
        "messageByLocale": {
          "en": "- How to add and configure the multiplayer behavior\n\n - How an online player can control their character with the multiplayer ownership system",
          "fr": "- Comment ajouter et configurer le comportement multijoueur\n\n - Comment un joueur en ligne peut contrôler son personnage avec le système de propriété multijoueur",
          "ar": "- كيفية إضافة وتكوين سلوك متعدد اللاعبين\n\n - كيف يمكن للاعب عبر الإنترنت التحكم في شخصيته باستخدام نظام الملكية متعدد اللاعبين",
          "de": "- Wie man das Mehrspieler-Verhalten hinzufügt und konfiguriert\n\n - Wie ein Online-Spieler seinen Charakter mit dem Mehrspieler-Eigentumssystem steuern kann",
          "es": "- Cómo añadir y configurar el comportamiento multijugador\n\n - Cómo un jugador en línea puede controlar su personaje con el sistema de propiedad multijugador",
          "it": "- Come aggiungere e configurare il comportamento multiplayer\n\n - Come un giocatore online può controllare il suo personaggio con il sistema di proprietà multiplayer",
          "tr": "- Çok oyunculu davranışı nasıl ekleyip yapılandıracağınızı\n\n - Çevrimiçi bir oyuncunun çok oyunculu sahiplik sistemiyle karakterini nasıl kontrol edebileceğini",
          "ja": "- マルチプレイヤーの動作を追加および設定する方法\n\n - オンラインプレイヤーがマルチプレイヤー所有システムで自分のキャラクターを制御する方法",
          "ko": "- 멀티플레이어 동작 추가 및 구성 방법\n\n - 온라인 플레이어가 멀티플레이어 소유권 시스템으로 캐릭터를 제어하는 방법",
          "pl": "- Jak dodać i skonfigurować zachowanie wieloosobowe\n\n - Jak gracz online może kontrolować swoją postać za pomocą systemu własności wieloosobowej",
          "pt": "- Como adicionar e configurar o comportamento multiplayer\n\n - Como um jogador online pode controlar seu personagem com o sistema de propriedade multiplayer",
          "th": "- วิธีการเพิ่มและกำหนดค่าพฤติกรรมการเล่นหลายคน\n\n - วิธีการที่ผู้เล่นออนไลน์สามารถควบคุมตัวละครของเขาด้วยระบบการเป็นเจ้าของหลายคน",
          "ru": "- Как добавить и настроить мультиплеерное поведение\n\n - Как онлайн-игрок может контролировать своего персонажа с помощью системы владения в мультиплеере",
          "sl": "- Kako dodati in konfigurirati večigralsko vedenje\n\n - Kako lahko spletni igralec nadzoruje svoj lik s sistemom lastništva večigralstva",
          "sq": "- Si të shtoni dhe të konfiguroni sjelljen multiplayer\n\n - Si një lojtar në linjë mund të kontrollojë personazhin e tij me sistemin e pronësisë multiplayer",
          "uk": "- Як додати та налаштувати багатокористувацьку поведінку\n\n - Як онлайн-гравець може контролювати свого персонажа за допомогою системи власності в багатокористувацькому режимі",
          "zh": "- 如何添加和配置多人游戏行为\n\n - 在线玩家如何通过多人游戏所有权系统控制其角色"
        }
      },
      {
        "messageByLocale": {
          "en": "You can keep adding stuff to this game or publish it!",
          "fr": "Vous pouvez continuer à ajouter des éléments à ce jeu ou le publier !",
          "ar": "يمكنك الاستمرار في إضافة أشياء إلى هذه اللعبة أو نشرها!",
          "de": "Sie können weiterhin Dinge zu diesem Spiel hinzufügen oder es veröffentlichen!",
          "es": "¡Puedes seguir añadiendo cosas a este juego o publicarlo!",
          "it": "Puoi continuare ad aggiungere cose a questo gioco o pubblicarlo!",
          "tr": "Bu oyunu geliştirmeye veya yayınlamaya devam edebilirsiniz!",
          "ja": "このゲームにさらに要素を追加するか、それを公開することができます！",
          "ko": "이 게임에 계속해서 새로운 요소를 추가하거나 게임을 게시할 수 있습니다!",
          "pl": "Możesz dalej dodawać rzeczy do tej gry lub ją opublikować!",
          "pt": "Você pode continuar adicionando coisas a este jogo ou publicá-lo!",
          "th": "คุณสามารถเพิ่มสิ่งต่างๆในเกมนี้ต่อได้หรือตีพิมพ์!",
          "ru": "Вы можете продолжать добавлять вещи в эту игру или опубликовать ее!",
          "sl": "Lahko še naprej dodajate stvari v to igro ali jo objavite!",
          "sq": "Mund të vazhdoni të shtoni gjëra në këtë lojë ose ta publikoni atë!",
          "uk": "Ви можете продовжувати додавати речі до цієї гри або опублікувати її!",
          "zh": "您可以继续添加内容到这个游戏中或发布它！"
        }
      }
    ]
  }
}
